In [1]:
import pandas as pd
import numpy as np

In [2]:
# Create sample data
data = {
    'student_id': [1, 2, 3, 4, 5, 6, 7, 8],
    'name': ['Ali', 'Sara', 'Hassan', 'Mona', 'Khalid', 'Fatma', 'Omar', 'Layla'],
    'age': [22, np.nan, 24, 23, np.nan, 25, 21, np.nan],
    'python_marks': [85, 90, np.nan, 92, 88, np.nan, 80, 87],
    'excel_marks': [75, 82, 70, np.nan, 85, 90, np.nan, 88],
    'location': ['Muscat', 'Sohar', np.nan, 'Salalah', 'Muscat', 'Sohar', 'Nizwa', np.nan]
}

In [3]:
# Create DataFrame
df = pd.DataFrame(data)
print(df)

   student_id    name   age  python_marks  excel_marks location
0           1     Ali  22.0          85.0         75.0   Muscat
1           2    Sara   NaN          90.0         82.0    Sohar
2           3  Hassan  24.0           NaN         70.0      NaN
3           4    Mona  23.0          92.0          NaN  Salalah
4           5  Khalid   NaN          88.0         85.0   Muscat
5           6   Fatma  25.0           NaN         90.0    Sohar
6           7    Omar  21.0          80.0          NaN    Nizwa
7           8   Layla   NaN          87.0         88.0      NaN

In [4]:
#Q1. Detect Missing Values
# Display which cells in the DataFrame contain missing values and count how many are missing in each column.(Hint: Use isnull() and sum().)
df.isna().sum()

student_id      0
name            0
age             3
python_marks    2
excel_marks     2
location        2
dtype: int64

In [11]:
#Q2. Drop Missing Values
#Remove all rows where any column has a missing value.How many rows remain after this operation?(Hint: Use dropna().)
df.dropna(inplace=False)

   student_id name   age  python_marks  excel_marks location
0           1  Ali  22.0          85.0         75.0   Muscat

In [18]:
#Q3. Fill with a Static Value
#Replace all missing values in the location column with 'Unknown'.(Hint: Use fillna('Unknown').)
df["location"].fillna("Unknown", inplace=True)
df

   student_id    name   age  python_marks  excel_marks location
0           1     Ali  22.0          85.0         75.0   Muscat
1           2    Sara   NaN          90.0         82.0    Sohar
2           3  Hassan  24.0           NaN         70.0  Unknown
3           4    Mona  23.0          92.0          NaN  Salalah
4           5  Khalid   NaN          88.0         85.0   Muscat
5           6   Fatma  25.0           NaN         90.0    Sohar
6           7    Omar  21.0          80.0          NaN    Nizwa
7           8   Layla   NaN          87.0         88.0  Unknown

In [38]:
#Q4. Fill with Mean
#Fill all missing values in the age column with the average (mean) age of the available students.(Hint: Use fillna(df['age'].mean()).)
df["age"] = df["age"].fillna(df["age"].mean())
df

,student_id,name,age,python_marks,excel_marks,location,date,date_of_purchas
0,1,Ali,22.0,85.0,75.0,Muscat,2025-10-01,2025-10-01
1,2,Sara,23.0,90.0,82.0,Sohar,2025-10-02,2025-10-02
2,3,Hassan,24.0,NaN,70.0,Unknown,2025-10-03,2025-10-03
3,4,Mona,23.0,92.0,NaN,Salalah,2025-10-04,2025-10-04
4,5,Khalid,23.0,88.0,85.0,Muscat,2025-10-05,2025-10-05
5,6,Fatma,25.0,NaN,90.0,Sohar,2025-10-06,2025-10-06
6,7,Omar,21.0,80.0,NaN,Nizwa,2025-10-07,2025-10-07
7,8,Layla,23.0,87.0,88.0,Unknown,2025-10-08,2025-10-08

In [41]:
#Q5. Fill with Median
#Fill missing values in the excel_marks column using the median of that column.(Hint: Use df['excel_marks'].fillna(df['excel_marks'].median()).)
df["excel_marks"] = df["excel_marks"].fillna(df["excel_marks"].median())
df

,student_id,name,age,python_marks,excel_marks,location,date,date_of_purchas,gender
0,1,Ali,22.0,85.0,75.0,Muscat,2025-10-01,2025-10-01,Male
1,2,Sara,23.0,90.0,82.0,Sohar,2025-10-02,2025-10-02,Female
2,3,Hassan,24.0,NaN,70.0,Unknown,2025-10-03,2025-10-03,Male
3,4,Mona,23.0,92.0,83.5,Salalah,2025-10-04,2025-10-04,Female
4,5,Khalid,23.0,88.0,85.0,Muscat,2025-10-05,2025-10-05,Male
5,6,Fatma,25.0,NaN,90.0,Sohar,2025-10-06,2025-10-06,Female
6,7,Omar,21.0,80.0,83.5,Nizwa,2025-10-07,2025-10-07,Male
7,8,Layla,23.0,87.0,88.0,Unknown,2025-10-08,2025-10-08,Female

In [44]:
#Q6. Forward Fill (ffill)
#Use forward fill to fill the missing values in the python_marks column.(Hint: Use fillna(method='ffill').)
df["python_marks"] = df["python_marks"].ffill()
df

,student_id,name,age,python_marks,excel_marks,location,date,date_of_purchas,gender
0,1,Ali,22.0,85.0,75.0,Muscat,2025-10-01,2025-10-01,1
1,2,Sara,23.0,90.0,82.0,Sohar,2025-10-02,2025-10-02,0
2,3,Hassan,24.0,90.0,70.0,Unknown,2025-10-03,2025-10-03,1
3,4,Mona,23.0,92.0,83.5,Salalah,2025-10-04,2025-10-04,0
4,5,Khalid,23.0,88.0,85.0,Muscat,2025-10-05,2025-10-05,1
5,6,Fatma,25.0,88.0,90.0,Sohar,2025-10-06,2025-10-06,0
6,7,Omar,21.0,80.0,83.5,Nizwa,2025-10-07,2025-10-07,1
7,8,Layla,23.0,87.0,88.0,Unknown,2025-10-08,2025-10-08,0

In [45]:
#Q7. Fill missing values in the age column using backward fill.(Hint: Use fillna(method='bfill'))
df["age"] = df["age"].bfill()
df

,student_id,name,age,python_marks,excel_marks,location,date,date_of_purchas,gender
0,1,Ali,22.0,85.0,75.0,Muscat,2025-10-01,2025-10-01,1
1,2,Sara,23.0,90.0,82.0,Sohar,2025-10-02,2025-10-02,0
2,3,Hassan,24.0,90.0,70.0,Unknown,2025-10-03,2025-10-03,1
3,4,Mona,23.0,92.0,83.5,Salalah,2025-10-04,2025-10-04,0
4,5,Khalid,23.0,88.0,85.0,Muscat,2025-10-05,2025-10-05,1
5,6,Fatma,25.0,88.0,90.0,Sohar,2025-10-06,2025-10-06,0
6,7,Omar,21.0,80.0,83.5,Nizwa,2025-10-07,2025-10-07,1
7,8,Layla,23.0,87.0,88.0,Unknown,2025-10-08,2025-10-08,0

In [19]:
df['date'] = ['2025-10-01', '2025-10-02', '2025-10-03', '2025-10-04', '2025-10-05', '2025-10-06', '2025-10-07', '2025-10-08']
print(df)

   student_id    name   age  python_marks  excel_marks location        date
0           1     Ali  22.0          85.0         75.0   Muscat  2025-10-01
1           2    Sara   NaN          90.0         82.0    Sohar  2025-10-02
2           3  Hassan  24.0           NaN         70.0  Unknown  2025-10-03
3           4    Mona  23.0          92.0          NaN  Salalah  2025-10-04
4           5  Khalid   NaN          88.0         85.0   Muscat  2025-10-05
5           6   Fatma  25.0           NaN         90.0    Sohar  2025-10-06
6           7    Omar  21.0          80.0          NaN    Nizwa  2025-10-07
7           8   Layla   NaN          87.0         88.0  Unknown  2025-10-08

In [24]:
df["date_of_purchas"] = pd.to_datetime(df["date"],errors = "coerce")
df

,student_id,name,age,python_marks,excel_marks,location,date,date_of_purchas
0,1,Ali,22.0,85.0,75.0,Muscat,2025-10-01,2025-10-01
1,2,Sara,NaN,90.0,82.0,Sohar,2025-10-02,2025-10-02
2,3,Hassan,24.0,NaN,70.0,Unknown,2025-10-03,2025-10-03
3,4,Mona,23.0,92.0,NaN,Salalah,2025-10-04,2025-10-04
4,5,Khalid,NaN,88.0,85.0,Muscat,2025-10-05,2025-10-05
5,6,Fatma,25.0,NaN,90.0,Sohar,2025-10-06,2025-10-06
6,7,Omar,21.0,80.0,NaN,Nizwa,2025-10-07,2025-10-07
7,8,Layla,NaN,87.0,88.0,Unknown,2025-10-08,2025-10-08

In [34]:
df["date_of_purchas"].dtype
#dtype = Data type (from NumPy or pandas)
#<	= Byte order — < means little-endian (normal on most systems)
# M8 = Means datetime64 — a NumPy datetime type
#[ns] = The time unit = nanoseconds

dtype('<M8[ns]')

In [33]:
#for AI and machine porpese
from sklearn.preprocessing import OneHotEncoder
encoder = OneHotEncoder(sparse_output = False)
encoded_date = encoder.fit_transform(df[['location']])

In [47]:
#to show the output
encoded_date

array([[1., 0., 0., 0., 0.],
       [0., 0., 0., 1., 0.],
       [0., 0., 0., 0., 1.],
       [0., 0., 1., 0., 0.],
       [1., 0., 0., 0., 0.],
       [0., 0., 0., 1., 0.],
       [0., 1., 0., 0., 0.],
       [0., 0., 0., 0., 1.]])

In [39]:
# Add 'gender' column
df['gender'] = ['Male', 'Female', 'Male', 'Female', 'Male', 'Female', 'Male', 'Female']

In [40]:
df

,student_id,name,age,python_marks,excel_marks,location,date,date_of_purchas,gender
0,1,Ali,22.0,85.0,75.0,Muscat,2025-10-01,2025-10-01,Male
1,2,Sara,23.0,90.0,82.0,Sohar,2025-10-02,2025-10-02,Female
2,3,Hassan,24.0,NaN,70.0,Unknown,2025-10-03,2025-10-03,Male
3,4,Mona,23.0,92.0,NaN,Salalah,2025-10-04,2025-10-04,Female
4,5,Khalid,23.0,88.0,85.0,Muscat,2025-10-05,2025-10-05,Male
5,6,Fatma,25.0,NaN,90.0,Sohar,2025-10-06,2025-10-06,Female
6,7,Omar,21.0,80.0,NaN,Nizwa,2025-10-07,2025-10-07,Male
7,8,Layla,23.0,87.0,88.0,Unknown,2025-10-08,2025-10-08,Female

In [46]:
#Encoded to change gender male = 1, female = 0
from sklearn.preprocessing import LabelEncoder
le = LabelEncoder()
df["gender"] = le.fit_transform(df["gender"])

In [43]:
df

,student_id,name,age,python_marks,excel_marks,location,date,date_of_purchas,gender
0,1,Ali,22.0,85.0,75.0,Muscat,2025-10-01,2025-10-01,1
1,2,Sara,23.0,90.0,82.0,Sohar,2025-10-02,2025-10-02,0
2,3,Hassan,24.0,NaN,70.0,Unknown,2025-10-03,2025-10-03,1
3,4,Mona,23.0,92.0,83.5,Salalah,2025-10-04,2025-10-04,0
4,5,Khalid,23.0,88.0,85.0,Muscat,2025-10-05,2025-10-05,1
5,6,Fatma,25.0,NaN,90.0,Sohar,2025-10-06,2025-10-06,0
6,7,Omar,21.0,80.0,83.5,Nizwa,2025-10-07,2025-10-07,1
7,8,Layla,23.0,87.0,88.0,Unknown,2025-10-08,2025-10-08,0